<template>
<div>
<h4>关于前端高级工程师面试</h4>
<br>
<pre>
<h5> 一：基础知识</h5>
Vue 基本的双向绑定实现原理<br>
vue 生命周期 每个状态差别。<br>
生命周期中何时能操作提取 DOM 样式属性？何时请求 API 渲染？为什么？ 销毁之前一般要处理哪些东西？<br>
为什么要处理？到底是什么原因导致这种弊端存在？<br>
Vue 自定义指令实现基本底层原理？<br>
Vue mixin 原理 你是如何使用的 ？<br>
如何做到路由无改变情况下点击菜单栏，当前页面局部刷新？
Inject 是否用过？Observe 是否用过？（这两个问题 牵扯高级部分，水平一般的也不会问。）
Vue 父子，兄弟组件传参问题。有哪些方法可以实现？你能说出几种？ 跨多个打开页面数据共享呢？
说出几种实现途径。不论前后端都可以说 Vue 中如何监听调用原生 window 事件？ 
你是如何使用 VUE，UMD？还是 cli 方式？ Cli?2.x?3.x?常用配置?差别？
Vuex 的根本实现原理？
你说熟悉 jquery，那你能否解释一下：事件派发，事件委托的原理？
Vue-router 的两种模式，深度解释一下。和 H5 新的 API 有何关联？ Vue-router 的路由拦截 或者叫 守护。
你在项目中如何使用？全局的，局部的，权限的。
Vue-router 本质上是一种什么东西？（个人认为是哈希参照表,jJSON 配置文件）
你们的前后端交互数据传输，使用的什么？是否做过封装？
Axios,前后拦截封装，如何发送 formdata ，文件类型数据？
ES6 你开发中常用的一些方法，详细解释一下。
ES6 和 ES5 本质底层差别不大，大部分是语法糖。你对于语法糖怎么看？
闭包原理？实际开发中你是如何使用？一般用来做什么？
存储问题，几种存储的区别。
跨域问题，解决方案，每种方案原理？ 
Bootstrap 等 UI 框架栅栏布局原理。
Flex 几个重要属性，或者讲出来可以对实现什么？
数组的常用操作？
Object.assign 是深拷贝还是浅拷贝？
作用域链
</pre>
<pre>
<h5>二扩展层面</h5>
Js 本身存在一定局限性，在实际开法中，可能需要自己做一些常用工具函数的封装。 
你是否用过插件，或者 js 扩展库，或者讲一讲自己的常用封装。 
如果让你现在写一个常用的，对象的深层拷贝，讲一讲你的思路。
如果让你现在写一个常用的，对象的深层合并（并去重），讲一讲你的思路。
递归，如何跳出递归？你是否用过？ 运行种换肤问题。
Vuecli 多入口。 一般不问。
Vuecli webpack 你是逗深入了解 过？ 图片压缩，代码压缩， 文件名，等，这些一般略过。
目前前端开发面向终端较多，各种设备，你是否有使用过跨多端开发框架。
讲一讲 （跨多端框架很重要，跨多端输出工具其次） 和你配合开发过项目的前后端交互的后台开发语言有哪些？ 
你们的项目如何部署的？ 
你是否掌握其他后端可开发语言，如果会，讲一讲你的前后端独立开发怎么进行。
也会稍微问一些语言的共通性，也就是相似的地方。 
（一般的中上等以上的工程师，都基本会一些其他语言）
<h5>三架构层次</h5>
你是否有过中大型项目独立开发经验？讲一讲，你是如何进行架构设计的。
代码规范层次。 你做过这么多项目，是否有过封装，有哪些方向的封装，讲一讲。
如果现在让你写一套样式库，你打算如何入手。
超大型项目，运行种换肤问题。
页面防抖问题，说根本。
你是否写过通用函数封装，讲一讲都做过哪些？功用是什么，为什么需要这种封装？ 
你是都对你所使用的的 UI 框架二次优化过，讲一讲。 
多个项目开发，你是否认为多数项目在操作层面的代码方面上有一定的相似性，你是逗做过 抽离封装，可以跨多个项目使用。深入讲一讲。 
模块化开发，狭义上来讲是说组件。深层来理解，很多东西都可以分为模块，而大型项目 不进行模块化开发，几乎不可能。
请从各个方面讲一讲，如果让你负责开发超大型项目，技 术架构方面你会如何处理？或者有什么想法都可以说说。
前端静态化部署。 
伪静态
如果一套代码 应对一百个网站，每个网站存在一定差异性，如何规划？如何同步上新？
SSR 问题。  
首屏优化。网络很差的情况下如何首屏优化。 
CDN 加速问题。 分布式问题 如果项目需要你用前端来写爬虫，你如何规划？
<h5>四工作流和管理问题</h5>
这个也就是聊一聊谈谈，一般很少能到这一块的。
工作流和管理，一部分是你是否有过协作 开发经验、大公司开发经验、管理多人负责项目经验。
<h5>五技术主管和总监</h5>
技术主管和总监根本和以上这些都不在一个层次，属于管理层，但是基本都是可开发出身。
技术能力基本肯定是真正的全栈，多语言精通的。还要能把握方向，懂得各部分沟通交流，熟悉工作和管理流程。 
小公司的 就不谈这个问题了，没那么多要求。
</pre>
</div>
</template>
<script>
export default {};
</script>
<style lang="scss" scoped></style>
