<template>
    <div>
     <pre>
         用户权限：
su 切换用户账户
格式：
【su 用户名 】
【su】 切换到root
【su root】 切换到root
【su -】 切换到root用户 同时切换到root目录

添加组：
【groupadd 组名】  添加组  需要用户权限
删除组
【groupdel 组名】  删除组  需要用户权限和清空组成员
修改用户所在组：
【usermod -g 组名 用户名1 用户名2】需要用户权限

添加用户：
【useradd -d /home/目录 用户名 -g 组名 -m】新建用户 设置用户主目录和设置组名 并自动创建  需要用户权限

设置密码：
【passwd 用户名】设置密码 需要用户权限

删除用户：
【userdel -r 用户名】 删除用户递归删除该用户所有文件 需要用户权限

修改文件权限：
字符法格式：【chmod -u|g|o|a +|- rwc 文件1 文件2】
d rwx r-x r-x
u user +|- rwx
g group +|- rwx
o other +|- rwx
a all +|- rwx
chmod u + x
数字法格式：
 r w x
 0 0 0  ---  0
 0 0 1  --x  1
 0 1 0  -w-  2
 0 1 1  -wx  3
 1 0 0  r--  4
 1 0 1  r-x  5
 1 1 0  rw-  6
 1 1 1  rwx  7


【chmod 372 文件名1 文件名2】

rwx rwx rwx
421 421 421

rw- r-x r--

-wx rwx -w-

r--------

rw- rw- r--
chmod 6 6 4  a.txt


修改文件所有者：
【chown 用户名 文件1 文件2 目录1 目录2】需要用户权限
修改文件组：
【chgrp 组名 文件1 文件2 目录1 目录2】需要用户权限


编辑器：
VI编辑器有两个模式：文本编辑模式 命令行处理模式
进入编辑器：
1、vi 文件名  2、vim 
操作编辑器：
【i】在光标当前位置插入
【a】在光标右侧位置插入
【o】在光标下一行位置开启新的一行插入
【O】在光标上一行位置开启新的一行插入
【I】在光标当前行行首插入
【A】在光标当前行行尾插入

退出编辑器：
【ZZ】保存退出
【:wq】保存退出
【:x】保存退出
【:w 文件名】保存到指定文件中
【:q】 保存退出 针对未修改的文件 注意：未保存文件会提示 无法退出
【:q!】 强制退出  退出 不保存
【:! 命令】暂时离开vi 执行其他命令

案例：
打开vi  源文件.c
进入插入模式 
#include stdio.h

int main(void)
{
	printf("hello world!\n");
	return 0;
}
退出保存

编译程序
gcc -o 可执行程序  源文件.c

./可执行程序

编辑器操作：
【[n]x】删除光标位置后面n个字符
【[n]X】删除光标位置前面n个字符
【D】删除光标所在位置后面到行尾的所有字符
【[n]dd】删除光标所在行及下面n行   剪切
【p】在光标下一行粘贴
【[n]yy】复制光标所在行及下面n行 
【dG】删除光标所在行到文件结尾
【J】合并光标所在行和下一行 中间用空格连接
【.】执行上一次命令行操作
【u】撤销


编辑器定位：
【ctrl+b】回滚 行号减小
【ctrl+f】前滚 行号增加
【gg】定位在文件第一行行首
【G】定位在文件最后一行行首
【:$】定位在文件最后一行行首
【[n]G | [n]gg】定位在m行
注意：在查找一些特殊含义的字符时，需要加上转义字符
【/内容】查找
【n】查找下一个
【N】查找上一个
【?】查找上一次的所搜内容
【/^word】 查找以word开头的内容
【/word$】 查找以word结尾的内容
【/.】查找任意一个字符
【/*】查找任意多个字符

编辑器替换：
【r】替换光标所在位置的字符
【:r 文件名】在光标当前行的下一行插入一个文件 每次添加只能添加一个文件
【:s/a/b/g】将光标所在行的a替换为b
【:g/a/s//b/g】将文件中所有a替换为b
【:n1,n2s/a/b/g】将行区间n1到n2的行中所有的a替换为b

编辑器设置：
【:set ic】搜索时不区分大小写
【:set noic】搜索时区分大小写


     </pre>
    </div>
</template>

<script>
    export default {
        
    }
</script>

<style lang="scss" scoped>

</style>